Revit 2027 API
ParameterTypeId.StructuralBeamEndSupport Property
 "Beam End Pocket Seat"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralBeamEndSupport { get; }
Public Shared ReadOnly Property StructuralBeamEndSupport As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralBeamEndSupport {
	ForgeTypeId^ get ();
}
static member StructuralBeamEndSupport : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace